src/cf/src/DataProcessors/Дашборд/Дашборд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Дашборд</name>
  <comment>Аналитические панели с показателями и диаграммами. Одна форма — одна панель, у каждой своя команда.</comment>
</mdclass:DataProcessor>

src/cf/src/InformationRegisters/ИсторияЗаказовПокупателейПоСтатусам/ИсторияЗаказовПокупателейПоСтатусам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияЗаказовПокупателейПоСтатусам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СтатусЗаказаПокупателя</name>
    <type>
      <types>EnumRef.СтатусыЗаказовПокупателя</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляОбеспечения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляПоступления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляВыпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляОтгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Индикатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/МинимальныйОстатокПоСкладам/МинимальныйОстатокПоСкладам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МинимальныйОстатокПоСкладам</name>
  <resources>
    <name>МинимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеРасходы</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>Выручка</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>ВаловаяПрибыль</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ЗаказыПоставщикам/ЗаказыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыПоставщикам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодСтроки</name>
    <type>
      <types>DefinedType.КодСтроки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСWEBСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПодтвердилПроверилОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/DataProcessors/Дашборд/Forms/БазовыйДашборд/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СоздатьЭлементыДашборда();
	Если Элементы.Найти("ЗначениеВыручка30") <> Неопределено Тогда
		ОбновитьДанныеДашборда();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)

	Если Элементы.Найти("ЗначениеВыручка30") <> Неопределено Тогда
		ОбновитьДанныеДашборда();
	КонецЕсли;
	Если Элементы.Найти("ТаблицаЗаказы") <> Неопределено Тогда
		Элементы.ТаблицаЗаказы.Обновить();
		Элементы.ТаблицаСвязанные.Обновить();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьЭлементыДашборда()

	// Видимость закладок определяется составом ролей пользователя: оператор производства
	// видит только производственную закладку, показатели стока содержат суммы.
	// BSLLS:IsInRoleMethod-off
	Администратор = РольДоступна("Администратор");
	ОператорПроизводства = РольДоступна("ОператорПроизводства");
	// BSLLS:IsInRoleMethod-on
	ПоказыватьСток = Администратор Или Не ОператорПроизводства;
	ПоказыватьПроизводство = Администратор Или ОператорПроизводства;

	ДобавитьРеквизитыДашборда(ПоказыватьСток, ПоказыватьПроизводство);

	ИмяКоманды = "Обновить";
	КомандаОбновить = Команды.Добавить(ИмяКоманды);
	КомандаОбновить.Заголовок = НСтр("ru = 'Обновить'; fr = 'Actualiser'; en = 'Refresh'; es = 'Actualizar'");
	КомандаОбновить.Действие = ИмяКоманды;
	КомандаОбновить.Картинка = БиблиотекаКартинок.КруговыеСтрелки;

	КнопкаОбновить = Элементы.Добавить("КнопкаОбновить", Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанель);
	КнопкаОбновить.ИмяКоманды = ИмяКоманды;

	ГруппаЗакладок = Элементы.Добавить("ГруппаЗакладки", Тип("ГруппаФормы"));
	ГруппаЗакладок.Вид = ВидГруппыФормы.Страницы;
	ГруппаЗакладок.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	ГруппаЗакладок.РастягиватьПоГоризонтали = Истина;
	ГруппаЗакладок.РастягиватьПоВертикали = Истина;
	Если Не (ПоказыватьСток И ПоказыватьПроизводство) Тогда
		ГруппаЗакладок.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;

	Если ПоказыватьСток Тогда
		СоздатьСтраницуСтока(ГруппаЗакладок);
	КонецЕсли;
	Если ПоказыватьПроизводство Тогда
		СоздатьСтраницуПроизводства(ГруппаЗакладок, ПоказыватьСток);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизитыДашборда(ПоказыватьСток, ПоказыватьПроизводство)

	ТипДиаграмма = Новый ОписаниеТипов("Диаграмма");
	ТипДинамическийСписок = Новый ОписаниеТипов("ДинамическийСписок");

	ДобавляемыеРеквизиты = Новый Массив;
	Если ПоказыватьСток Тогда
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ДиаграммаВыручка", ТипДиаграмма));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ДиаграммаОстатки", ТипДиаграмма));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ДиаграммаПотребности", ТипДиаграмма));
	КонецЕсли;
	Если ПоказыватьПроизводство Тогда
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ДСЗаказы", ТипДинамическийСписок));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ДСТоварыЗаказа", ТипДинамическийСписок));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ДССвязанные", ТипДинамическийСписок));
	КонецЕсли;
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);

КонецПроцедуры

&НаСервере
Функция ДобавитьСтраницу(Имя, Заголовок, ГруппаЗакладок)

	Страница = Элементы.Добавить(Имя, Тип("ГруппаФормы"), ГруппаЗакладок);
	Страница.Вид = ВидГруппыФормы.Страница;
	Страница.Заголовок = Заголовок;
	Страница.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Возврат Страница;

КонецФункции

#Область Сток

&НаСервере
Процедура СоздатьСтраницуСтока(ГруппаЗакладок)

	Страница = ДобавитьСтраницу("СтраницаСток",
		НСтр("ru = 'Сток'; fr = 'Stock'; en = 'Stock'; es = 'Stock'"), ГруппаЗакладок);

	ГруппаПоказателей = ДобавитьГруппу("ГруппаПоказатели", Ложь, Страница);
	ДобавитьКарточкуПоказателя(ГруппаПоказателей, "Выручка30",
		НСтр("ru = 'Выручка за 30 дней'; fr = 'CA sur 30 jours'; en = 'Revenue, 30 days'; es = 'Ingresos, 30 días'"));
	ДобавитьКарточкуПоказателя(ГруппаПоказателей, "Прибыль30",
		НСтр("ru = 'Валовая прибыль за 30 дней'; fr = 'Marge brute sur 30 jours';
			|en = 'Gross profit, 30 days'; es = 'Beneficio bruto, 30 días'"));
	ДобавитьКарточкуПоказателя(ГруппаПоказателей, "СтоимостьСклада",
		НСтр("ru = 'Стоимость остатков'; fr = 'Valeur du stock'; en = 'Stock value'; es = 'Valor del stock'"));
	ДобавитьКарточкуПоказателя(ГруппаПоказателей, "НижеЛимита",
		НСтр("ru = 'Позиций ниже лимита'; fr = 'Articles sous la limite'; en = 'Items below limit'; es = 'Artículos bajo el límite'"));

	ГруппаВерхнихДиаграмм = ДобавитьГруппу("ГруппаВерхниеДиаграммы", Истина, Страница);
	ДобавитьПолеДиаграммы(ГруппаВерхнихДиаграмм, "ДиаграммаВыручка",
		НСтр("ru = 'Выручка по клиентам за 30 дней'; fr = 'CA par client sur 30 jours';
			|en = 'Revenue by customer, 30 days'; es = 'Ingresos por cliente, 30 días'"));
	ДобавитьПолеДиаграммы(ГруппаВерхнихДиаграмм, "ДиаграммаОстатки",
		НСтр("ru = 'Остатки по товарным группам'; fr = 'Stock par groupe de produits';
			|en = 'Stock by product group'; es = 'Stock por grupo de productos'"));

	ГруппаНижнихДиаграмм = ДобавитьГруппу("ГруппаНижниеДиаграммы", Истина, Страница);
	ДобавитьПолеДиаграммы(ГруппаНижнихДиаграмм, "ДиаграммаПотребности",
		НСтр("ru = 'Потребности и лимиты: дефицитные позиции'; fr = 'Besoins et limites : articles en déficit';
			|en = 'Needs and limits: items in deficit'; es = 'Necesidades y límites: artículos en déficit'"));

КонецПроцедуры

&НаСервере
Функция ДобавитьГруппу(Имя, РастягиватьПоВертикали, Родитель)

	Группа = Элементы.Добавить(Имя, Тип("ГруппаФормы"), Родитель);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа.ОтображатьЗаголовок = Ложь;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
	Группа.РастягиватьПоГоризонтали = Истина;
	Группа.РастягиватьПоВертикали = РастягиватьПоВертикали;
	Возврат Группа;

КонецФункции

&НаСервере
Процедура ДобавитьКарточкуПоказателя(Родитель, Имя, Подпись)

	Карточка = Элементы.Добавить("Карточка" + Имя, Тип("ГруппаФормы"), Родитель);
	Карточка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Карточка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Карточка.ОтображатьЗаголовок = Ложь;
	Карточка.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	Карточка.РастягиватьПоГоризонтали = Истина;

	ЭлементПодписи = Элементы.Добавить("Подпись" + Имя, Тип("ДекорацияФормы"), Карточка);
	ЭлементПодписи.Заголовок = Подпись;
	ЭлементПодписи.ЦветТекста = ЦветаСтиля.Цвет_ПоясняющийТекст;

	ЭлементЗначения = Элементы.Добавить("Значение" + Имя, Тип("ДекорацияФормы"), Карточка);
	ЭлементЗначения.Заголовок = "0";
	ЭлементЗначения.Шрифт = ШрифтыСтиля.Шрифт_Основной_Увеличенный;

КонецПроцедуры

&НаСервере
Процедура ДобавитьПолеДиаграммы(Родитель, ИмяРеквизита, Заголовок)

	Поле = Элементы.Добавить("Поле" + ИмяРеквизита, Тип("ПолеФормы"), Родитель);
	Поле.Вид = ВидПоляФормы.ПолеДиаграммы;
	Поле.ПутьКДанным = ИмяРеквизита;
	Поле.Заголовок = Заголовок;
	Поле.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	Поле.РастягиватьПоГоризонтали = Истина;
	Поле.РастягиватьПоВертикали = Истина;
	Поле.Высота = 12;

КонецПроцедуры

#КонецОбласти

#Область Производство

// Имена программно создаваемых реквизитов-списков - идентификаторы, их повтор
// в настройке, привязке таблиц и клиентских обработчиках неустраним.
// BSLLS:DuplicateStringLiteral-off

&НаСервере
Процедура СоздатьСтраницуПроизводства(ГруппаЗакладок, ПоказыватьСуммы)

	Страница = ДобавитьСтраницу("СтраницаПроизводство",
		НСтр("ru = 'Производство'; fr = 'Production'; en = 'Production'; es = 'Producción'"), ГруппаЗакладок);

	НастроитьСпискиПроизводства();

	ТаблицаЗаказов = ДобавитьТаблицуСписка(Страница, "ТаблицаЗаказы", "ДСЗаказы", Истина);
	ТаблицаЗаказов.УстановитьДействие("ПриАктивизацииСтроки", "Подключаемый_ЗаказыПриАктивизацииСтроки");
	ТаблицаЗаказов.УстановитьДействие("Выбор", "Подключаемый_ТаблицаДокументовВыбор");
	ДобавитьКолонкуСписка(ТаблицаЗаказов, "Номер");
	ДобавитьКолонкуСписка(ТаблицаЗаказов, "Дата");
	ДобавитьКолонкуСписка(ТаблицаЗаказов, "Контрагент");
	ДобавитьКолонкуСписка(ТаблицаЗаказов, "Статус");
	ДобавитьКолонкуСписка(ТаблицаЗаказов, "ДатаОтгрузки");
	Если ПоказыватьСуммы Тогда
		ДобавитьКолонкуСписка(ТаблицаЗаказов, "Сумма");
	КонецЕсли;
	ДобавитьКолонкуСписка(ТаблицаЗаказов, "Менеджер");
	ДобавитьКолонкуСписка(ТаблицаЗаказов, "Комментарий");

	ГруппаДеталей = ДобавитьГруппу("ГруппаДеталиПроизводства", Ложь, Страница);

	ТаблицаТоваров = ДобавитьТаблицуСписка(ГруппаДеталей, "ТаблицаТоварыЗаказа", "ДСТоварыЗаказа", Ложь);
	ДобавитьКолонкуСписка(ТаблицаТоваров, "НомерСтроки");
	ДобавитьКолонкуСписка(ТаблицаТоваров, "Номенклатура");
	ДобавитьКолонкуСписка(ТаблицаТоваров, "Характеристика");
	ДобавитьКолонкуСписка(ТаблицаТоваров, "Упаковка");
	ДобавитьКолонкуСписка(ТаблицаТоваров, "КоличествоУпаковок");

	ТаблицаСвязанных = ДобавитьТаблицуСписка(ГруппаДеталей, "ТаблицаСвязанные", "ДССвязанные", Ложь);
	ТаблицаСвязанных.УстановитьДействие("Выбор", "Подключаемый_ТаблицаДокументовВыбор");
	КолонкаДокумента = ДобавитьКолонкуСписка(ТаблицаСвязанных, "Ссылка");
	КолонкаДокумента.Заголовок =
		НСтр("ru = 'Связанный документ'; fr = 'Document lié'; en = 'Related document'; es = 'Documento relacionado'");

КонецПроцедуры

&НаСервере
Процедура НастроитьСпискиПроизводства()

	// Статус хранится в срезе последних регистра статусов: в произвольном запросе
	// динамического списка ни соединения с ним, ни параметров виртуальной таблицы не избежать.
	// BSLLS:JoinWithVirtualTable-off
	// BSLLS:VirtualTableCallWithoutParameters-off
	СписокЗаказов = ЭтотОбъект["ДСЗаказы"];
	СписокЗаказов.ПроизвольныйЗапрос = Истина;
	СписокЗаказов.ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДокументЗаказПокупателя.Ссылка КАК Ссылка,
	|	ДокументЗаказПокупателя.ПометкаУдаления КАК ПометкаУдаления,
	|	ДокументЗаказПокупателя.Проведен КАК Проведен,
	|	ДокументЗаказПокупателя.Номер КАК Номер,
	|	ДокументЗаказПокупателя.Дата КАК Дата,
	|	ДокументЗаказПокупателя.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ДокументЗаказПокупателя.Контрагент КАК Контрагент,
	|	ДокументЗаказПокупателя.Менеджер КАК Менеджер,
	|	ДокументЗаказПокупателя.Сумма КАК Сумма,
	|	ДокументЗаказПокупателя.Комментарий КАК Комментарий,
	|	ИсторияСтатусовСрезПоследних.СтатусЗаказаПокупателя КАК Статус
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ДокументЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияЗаказовПокупателейПоСтатусам.СрезПоследних КАК ИсторияСтатусовСрезПоследних
	|		ПО ДокументЗаказПокупателя.Ссылка = ИсторияСтатусовСрезПоследних.ЗаказПокупателя";
	// BSLLS:JoinWithVirtualTable-on
	// BSLLS:VirtualTableCallWithoutParameters-on
	СписокЗаказов.ОсновнаяТаблица = "Документ.ЗаказПокупателя";
	СписокЗаказов.ДинамическоеСчитываниеДанных = Истина;

	СписокТоваров = ЭтотОбъект["ДСТоварыЗаказа"];
	СписокТоваров.ПроизвольныйЗапрос = Истина;
	СписокТоваров.ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗаказПокупателяТЧТовары.НомерСтроки КАК НомерСтроки,
	|	ЗаказПокупателяТЧТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяТЧТовары.Характеристика КАК Характеристика,
	|	ЗаказПокупателяТЧТовары.Упаковка КАК Упаковка,
	|	ЗаказПокупателяТЧТовары.КоличествоУпаковок КАК КоличествоУпаковок
	|ИЗ
	|	Документ.ЗаказПокупателя.ТЧТовары КАК ЗаказПокупателяТЧТовары
	|ГДЕ
	|	ЗаказПокупателяТЧТовары.Ссылка = &Ссылка";

	// Порядок по дате связанного документа, поле через точку неизбежно:
	// критерий отбора отдаёт только Ссылка. BSLLS:QueryNestedFieldsByDot-off
	СписокСвязанных = ЭтотОбъект["ДССвязанные"];
	СписокСвязанных.ПроизвольныйЗапрос = Истина;
	СписокСвязанных.ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СвязанныеДокументы.Ссылка КАК Ссылка
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&Ссылка) КАК СвязанныеДокументы
	|
	|УПОРЯДОЧИТЬ ПО
	|	СвязанныеДокументы.Ссылка.Дата";
	// BSLLS:QueryNestedFieldsByDot-on

	ПустойЗаказ = Документы.ЗаказПокупателя.ПустаяСсылка();
	СписокТоваров.Параметры.УстановитьЗначениеПараметра("Ссылка", ПустойЗаказ);
	СписокСвязанных.Параметры.УстановитьЗначениеПараметра("Ссылка", ПустойЗаказ);

КонецПроцедуры

&НаСервере
Функция ДобавитьТаблицуСписка(Родитель, Имя, ИмяСписка, РастягиватьПоВертикали)

	Таблица = Элементы.Добавить(Имя, Тип("ТаблицаФормы"), Родитель);
	Таблица.ПутьКДанным = ИмяСписка;
	Таблица.РастягиватьПоГоризонтали = Истина;
	Таблица.РастягиватьПоВертикали = РастягиватьПоВертикали;
	Таблица.ИзменятьСоставСтрок = Ложь;
	Таблица.ИзменятьПорядокСтрок = Ложь;
	Если Не РастягиватьПоВертикали Тогда
		Таблица.ВысотаВСтрокахТаблицы = 5;
	КонецЕсли;
	Возврат Таблица;

КонецФункции

&НаСервере
Функция ДобавитьКолонкуСписка(Таблица, ИмяПоля)

	Колонка = Элементы.Добавить(Таблица.Имя + ИмяПоля, Тип("ПолеФормы"), Таблица);
	Колонка.Вид = ВидПоляФормы.ПолеНадписи;
	Колонка.ПутьКДанным = Таблица.ПутьКДанным + "." + ИмяПоля;
	Возврат Колонка;

КонецФункции

&НаКлиенте
Процедура Подключаемый_ЗаказыПриАктивизацииСтроки(Элемент)

	ТекущиеДанные = Элемент.ТекущиеДанные;
	Заказ = ?(ТекущиеДанные = Неопределено,
		ПредопределенноеЗначение("Документ.ЗаказПокупателя.ПустаяСсылка"), ТекущиеДанные.Ссылка);
	ЭтотОбъект["ДСТоварыЗаказа"].Параметры.УстановитьЗначениеПараметра("Ссылка", Заказ);
	ЭтотОбъект["ДССвязанные"].Параметры.УстановитьЗначениеПараметра("Ссылка", Заказ);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ТаблицаДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Ссылка = Элемент.ТекущиеДанные.Ссылка;
	ПараметрыОткрытия = Новый Структура("Ключ", Ссылка);
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияДокумента", ЭтотОбъект);
	ОткрытьФорму(ИмяФормыОбъекта(Ссылка), ПараметрыОткрытия, ЭтотОбъект, , , , Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияДокумента(Результат, ДопПараметры) Экспорт

	Элементы.ТаблицаЗаказы.Обновить();
	Элементы.ТаблицаСвязанные.Обновить();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяФормыОбъекта(Знач Ссылка)

	Возврат Ссылка.Метаданные().ПолноеИмя() + ".ФормаОбъекта";

КонецФункции

// BSLLS:DuplicateStringLiteral-on

#КонецОбласти

#Область ДанныеСтока

&НаСервере
Процедура ОбновитьДанныеДашборда()

	// Дашборд агрегирует данные регистров только на чтение; права ролей на сами регистры не требуются.
	УстановитьПривилегированныйРежим(Истина);

	Данные = ДанныеДашборда();

	Элементы.ЗначениеВыручка30.Заголовок = ФорматПоказателя(Данные.Выручка30);
	Элементы.ЗначениеПрибыль30.Заголовок = ФорматПоказателя(Данные.Прибыль30);
	Элементы.ЗначениеСтоимостьСклада.Заголовок = ФорматПоказателя(Данные.СтоимостьСклада);
	Элементы.ЗначениеНижеЛимита.Заголовок = ФорматПоказателя(Данные.НижеЛимита);

	ЗаполнитьДиаграммуВыручки(Данные.ВыручкаПоКлиентам);
	ЗаполнитьДиаграммуОстатков(Данные.ОстаткиПоГруппам);
	ЗаполнитьДиаграммуПотребностей(Данные.Потребности);

КонецПроцедуры

&НаСервере
Функция ФорматПоказателя(Значение)

	Число = Значение;
	Если Число = NULL Или Число = Неопределено Тогда
		Число = 0;
	КонецЕсли;
	Возврат Формат(Число, "ЧДЦ=0; ЧРГ=' '; ЧН=0");

КонецФункции

&НаСервере
Функция ДанныеДашборда()

	ДнейВПериодеПродаж = 30;
	СекундВСутках = 86400;
	КонецПериода = КонецДня(ТекущаяДатаСеанса());
	НачалоПериода = НачалоДня(КонецПериода - (ДнейВПериодеПродаж - 1) * СекундВСутках);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	// Дашборду нужны остатки по всему складу и все открытые заказы, отбор в виртуальных таблицах не сузить.
	// BSLLS:VirtualTableCallWithoutParameters-off
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыВНаличииОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(ТоварыВНаличииОстатки.КоличествоОстаток) КАК Количество,
	|	СУММА(ТоварыВНаличииОстатки.СуммаОстаток) КАК Сумма
	|ПОМЕСТИТЬ ВТОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыВНаличии.Остатки() КАК ТоварыВНаличииОстатки
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВНаличииОстатки.Номенклатура
	|;
	|ВЫБРАТЬ
	|	Лимиты.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(Лимиты.Лимит) КАК Лимит
	|ПОМЕСТИТЬ ВТЛимиты
	|ИЗ
	|	(ВЫБРАТЬ
	|		Номенклатура.Ссылка КАК Номенклатура,
	|		Номенклатура.МинимальноеКоличествоХранения КАК Лимит
	|	ИЗ
	|		Справочник.Номенклатура КАК Номенклатура
	|	ГДЕ
	|		Номенклатура.МинимальноеКоличествоХранения > 0
	|		И НЕ Номенклатура.ПометкаУдаления
	|	ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ
	|		МинимальныйОстаток.Номенклатура,
	|		МинимальныйОстаток.МинимальноеКоличествоХранения
	|	ИЗ
	|		РегистрСведений.МинимальныйОстатокПоСкладам КАК МинимальныйОстаток
	|	ГДЕ
	|		МинимальныйОстаток.МинимальноеКоличествоХранения > 0) КАК Лимиты
	|СГРУППИРОВАТЬ ПО
	|	Лимиты.Номенклатура
	|;
	|ВЫБРАТЬ ПЕРВЫЕ 10
	|	ПродажиОбороты.Контрагент КАК Контрагент,
	|	СУММА(ПродажиОбороты.ВыручкаОборот) КАК Выручка
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ПродажиОбороты
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.Контрагент
	|ИМЕЮЩИЕ
	|	СУММА(ПродажиОбороты.ВыручкаОборот) > 0
	|УПОРЯДОЧИТЬ ПО
	|	Выручка УБЫВ
	|;
	|ВЫБРАТЬ ПЕРВЫЕ 8
	|	НоменклатураСправочник.ТоварнаяГруппа КАК ТоварнаяГруппа,
	|	СУММА(Остатки.Сумма) КАК Сумма
	|ИЗ
	|	ВТОстатки КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправочник
	|		ПО Остатки.Номенклатура = НоменклатураСправочник.Ссылка
	|СГРУППИРОВАТЬ ПО
	|	НоменклатураСправочник.ТоварнаяГруппа
	|УПОРЯДОЧИТЬ ПО
	|	Сумма УБЫВ
	|;
	|ВЫБРАТЬ
	|	ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(ЗаказыОстатки.КоличествоОстаток) КАК Количество
	|ПОМЕСТИТЬ ВТЗаказано
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки() КАК ЗаказыОстатки
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыОстатки.Номенклатура
	|;
	|ВЫБРАТЬ ПЕРВЫЕ 10
	|	Лимиты.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(Остатки.Количество, 0) КАК Остаток,
	|	Лимиты.Лимит КАК Лимит,
	|	ЕСТЬNULL(Заказано.Количество, 0) КАК Заказано,
	|	Лимиты.Лимит - ЕСТЬNULL(Остатки.Количество, 0) КАК Дефицит
	|ИЗ
	|	ВТЛимиты КАК Лимиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстатки КАК Остатки
	|		ПО Лимиты.Номенклатура = Остатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаказано КАК Заказано
	|		ПО Лимиты.Номенклатура = Заказано.Номенклатура
	|ГДЕ
	|	ЕСТЬNULL(Остатки.Количество, 0) < Лимиты.Лимит
	|УПОРЯДОЧИТЬ ПО
	|	Дефицит УБЫВ
	|;
	|ВЫБРАТЬ
	|	СУММА(ПродажиОбороты.ВыручкаОборот) КАК Выручка,
	|	СУММА(ПродажиОбороты.ВаловаяПрибыльОборот) КАК ВаловаяПрибыль
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ПродажиОбороты
	|;
	|ВЫБРАТЬ
	|	СУММА(Остатки.Сумма) КАК СтоимостьСклада
	|ИЗ
	|	ВТОстатки КАК Остатки
	|;
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Лимиты.Номенклатура) КАК ЧислоПозиций
	|ИЗ
	|	ВТЛимиты КАК Лимиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстатки КАК Остатки
	|		ПО Лимиты.Номенклатура = Остатки.Номенклатура
	|ГДЕ
	|	ЕСТЬNULL(Остатки.Количество, 0) < Лимиты.Лимит";
	// BSLLS:VirtualTableCallWithoutParameters-on

	Пакет = Запрос.ВыполнитьПакет();

	Данные = Новый Структура;
	Данные.Вставить("ВыручкаПоКлиентам", Пакет[2].Выгрузить());
	Данные.Вставить("ОстаткиПоГруппам", Пакет[3].Выгрузить());
	Данные.Вставить("Потребности", Пакет[5].Выгрузить());

	ВыборкаПродаж = Пакет[6].Выбрать();
	ВыборкаПродаж.Следующий();
	Данные.Вставить("Выручка30", ВыборкаПродаж.Выручка);
	Данные.Вставить("Прибыль30", ВыборкаПродаж.ВаловаяПрибыль);

	ВыборкаСклада = Пакет[7].Выбрать();
	ВыборкаСклада.Следующий();
	Данные.Вставить("СтоимостьСклада", ВыборкаСклада.СтоимостьСклада);

	ВыборкаЛимитов = Пакет[8].Выбрать();
	ВыборкаЛимитов.Следующий();
	Данные.Вставить("НижеЛимита", ВыборкаЛимитов.ЧислоПозиций);

	Возврат Данные;

КонецФункции

&НаСервере
Процедура ЗаполнитьДиаграммуВыручки(Таблица)

	Диаграмма = ЭтотОбъект["ДиаграммаВыручка"];
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	Диаграмма.ТипДиаграммы = ТипДиаграммы.ГистограммаГоризонтальная;
	Серия = Диаграмма.Серии.Добавить(НСтр("ru = 'Выручка'; fr = 'CA'; en = 'Revenue'; es = 'Ingresos'"));
	Для Каждого Стр Из Таблица Цикл
		Точка = Диаграмма.Точки.Добавить(Строка(Стр.Контрагент));
		Диаграмма.УстановитьЗначение(Точка, Серия, Стр.Выручка);
	КонецЦикла;
	Диаграмма.Обновление = Истина;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДиаграммуОстатков(Таблица)

	ПустаяГруппа = НСтр("ru = 'Без группы'; fr = 'Sans groupe'; en = 'No group'; es = 'Sin grupo'");

	Диаграмма = ЭтотОбъект["ДиаграммаОстатки"];
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	Диаграмма.ТипДиаграммы = ТипДиаграммы.Круговая;
	Серия = Диаграмма.Серии.Добавить(НСтр("ru = 'Остатки'; fr = 'Stock'; en = 'Stock'; es = 'Stock'"));
	Для Каждого Стр Из Таблица Цикл
		ИмяГруппы = Строка(Стр.ТоварнаяГруппа);
		Если Не ЗначениеЗаполнено(Стр.ТоварнаяГруппа) Тогда
			ИмяГруппы = ПустаяГруппа;
		КонецЕсли;
		Точка = Диаграмма.Точки.Добавить(ИмяГруппы);
		Диаграмма.УстановитьЗначение(Точка, Серия, Стр.Сумма);
	КонецЦикла;
	Диаграмма.Обновление = Истина;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДиаграммуПотребностей(Таблица)

	Диаграмма = ЭтотОбъект["ДиаграммаПотребности"];
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	Диаграмма.ТипДиаграммы = ТипДиаграммы.Гистограмма;
	СерияОстаток = Диаграмма.Серии.Добавить(НСтр("ru = 'Остаток'; fr = 'Stock'; en = 'On hand'; es = 'Existencias'"));
	СерияЛимит = Диаграмма.Серии.Добавить(НСтр("ru = 'Лимит'; fr = 'Limite'; en = 'Limit'; es = 'Límite'"));
	СерияЗаказано = Диаграмма.Серии.Добавить(НСтр("ru = 'Заказано'; fr = 'Commandé'; en = 'Ordered'; es = 'Pedido'"));
	Для Каждого Стр Из Таблица Цикл
		Точка = Диаграмма.Точки.Добавить(Строка(Стр.Номенклатура));
		Диаграмма.УстановитьЗначение(Точка, СерияОстаток, Стр.Остаток);
		Диаграмма.УстановитьЗначение(Точка, СерияЛимит, Стр.Лимит);
		Диаграмма.УстановитьЗначение(Точка, СерияЗаказано, Стр.Заказано);
	КонецЦикла;
	Диаграмма.Обновление = Истина;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
